Конфигурации/DataProcessors/СдвигЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DataProcessor>
		<Properties>
			<Name>СдвигЗадач</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Конфигурации/InformationRegisters/ЗадачиСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>ЗадачиСотрудников</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Часы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВыходнойОтпуск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадач</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Исполнители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СсылкаНаДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДействиеПоЗадаче</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурации/DataProcessors/СдвигЗадач/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура СдвинутьЗадачи(Команда)
	СдвинутьЗадачиНаСервере();
КонецПроцедуры

&НаСервере
Процедура СдвинутьЗадачиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачиСотрудников.Период КАК Период
		|ИЗ
		|	РегистрСведений.ЗадачиСотрудников КАК ЗадачиСотрудников
		|ГДЕ
		|	ЗадачиСотрудников.Исполнитель = &Исполнитель
		|	И ЗадачиСотрудников.Период >= &Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период ВОЗР";
	
	Запрос.УстановитьПараметр("Исполнитель", Сотрудник);
	Запрос.УстановитьПараметр("Период", ДатаНачалаСдвига);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивПереносов = Новый Массив;
	ДатаПереносаКонечная = '00000000';
	ПерваяДата = Истина;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ПерваяДата Тогда
			 ДатаПереноса = ВыборкаДетальныеЗаписи.Период + ЧислоДнейСдвига * 24*60*60;
			 ПерваяДата = Ложь;
		ИначеЕсли ВыборкаДетальныеЗаписи.Период <> ДатаПереносаКонечная + 24*60*60 Тогда
			Если  ВыборкаДетальныеЗаписи.Период + ЧислоДнейСдвига * 24*60*60 <= ДатаПереносаКонечная Тогда
				ДатаПереноса = ДатаПереносаКонечная + 24*60*60; 
			Иначе
			 	ДатаПереноса = ВыборкаДетальныеЗаписи.Период + ЧислоДнейСдвига;
			КонецЕсли;
		Иначе
			 ДатаПереноса = ДатаПереносаКонечная + 24*60*60;   
		КонецЕсли;
		 
		ДатаПереносаКонечная = ПроверкаВозможностиПереноса(ДатаПереноса,Сотрудник);
		МассивПереносов.Добавить(ДатаПереносаКонечная);
		
	КонецЦикла;
	Если МассивПереносов.Количество() > 0 Тогда		
		УстановитьНовыеДаты(МассивПереносов);
		Сообщить("Задачи сдвинуты!");		
	Иначе
		Сообщить("Задач для сдвига не найдео!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверкаВозможностиПереноса(Дата,Исполнитель)
	Отпуск = ФункцииПроверки.ПроверкаОтпусков(Дата, Исполнитель);
	Выходной = ФункцииПроверки.ПроверкаГрафикаРаботы(Дата,Исполнитель);
	ДатаЗадачи = Дата;
	
	Если Отпуск Или Выходной Тогда
	 	ДатаЗадачи = ДатаЗадачи + 24*60*60;
		ДатаЗадачи =  ПроверкаВозможностиПереноса(ДатаЗадачи,Исполнитель);
	КонецЕсли; 
	
	Возврат ДатаЗадачи;

КонецФункции 

&НаСервере
Процедура УстановитьНовыеДаты(Массив)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачиСотрудников.Период КАК Период,
		|	ЗадачиСотрудников.ТипЗадачи,
		|	ЗадачиСотрудников.Задача,
		|	ЗадачиСотрудников.Исполнитель,
		|	ЗадачиСотрудников.СсылкаНаДокумент,
		|	ЗадачиСотрудников.Часы,
		|	ЗадачиСотрудников.ВыходнойОтпуск,
		|	ЗадачиСотрудников.Статус,
		|	ЗадачиСотрудников.Комментарий
		|ИЗ
		|	РегистрСведений.ЗадачиСотрудников КАК ЗадачиСотрудников
		|ГДЕ
		|	ЗадачиСотрудников.Исполнитель = &Исполнитель
		|	И ЗадачиСотрудников.Период >= &Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период ВОЗР";
	
	Запрос.УстановитьПараметр("Исполнитель", Сотрудник);
	Запрос.УстановитьПараметр("Период", ДатаНачалаСдвига);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Номер = 0;
	
 	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ЗадачиСотрудников.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(ВыборкаДетальныеЗаписи.Период);
		НаборЗаписей.Отбор.ТипЗадачи.Установить(ВыборкаДетальныеЗаписи.ТипЗадачи);
		НаборЗаписей.Отбор.Задача.Установить(ВыборкаДетальныеЗаписи.Задача);
		НаборЗаписей.Отбор.Исполнитель.Установить(ВыборкаДетальныеЗаписи.Исполнитель);
		НаборЗаписей.Отбор.СсылкаНаДокумент.Установить(ВыборкаДетальныеЗаписи.СсылкаНаДокумент);
		НаборЗаписей.Записать();
		
		МенеджерЗаписи = РегистрыСведений.ЗадачиСотрудников.СоздатьМенеджерЗаписи();			
		МенеджерЗаписи.Период = Массив[Номер];   
		МенеджерЗаписи.ТипЗадачи = ВыборкаДетальныеЗаписи.ТипЗадачи;
		МенеджерЗаписи.Задача = ВыборкаДетальныеЗаписи.Задача;
		МенеджерЗаписи.Исполнитель = ВыборкаДетальныеЗаписи.Исполнитель;
		МенеджерЗаписи.СсылкаНаДокумент = ВыборкаДетальныеЗаписи.СсылкаНаДокумент;
		МенеджерЗаписи.Часы = ВыборкаДетальныеЗаписи.Часы;
		МенеджерЗаписи.ВыходнойОтпуск = ВыборкаДетальныеЗаписи.ВыходнойОтпуск;
		МенеджерЗаписи.Статус = ВыборкаДетальныеЗаписи.Статус;
		МенеджерЗаписи.Комментарий = ВыборкаДетальныеЗаписи.Комментарий;
		МенеджерЗаписи.Записать();

		Номер = Номер + 1;
	КонецЦикла;	
КонецПроцедуры
